import { HashLink } from 'react-router-hash-link';
import PhoneLink from '../../../shared/ui/PhoneLink';
import cargoBgMobile from "../../../shared/assets/images/CargoBgMobile.png";
import cargoBgMD from "../../../shared/assets/images/CargoBgMd.png";
import cargoBgLG from "../../../shared/assets/images/CargoBgLg.png";
import cargoBgXL from "../../../shared/assets/images/CargoBgXl.png";
import cargoBgDefault from "../../../shared/assets/images/CargoBgDefault.png";

const CargoHome: React.FC = () => {
  return (
    <div className="relative flex flex-col md:flex-row overflow-hidden leading-none rounded-b-[10px]">
      <div className="absolute inset-0 z-0 min-h-[60vh] md:min-h-[50vh] lg:min-h-[60vh] 2xl:min-h-[40vh]">
        <div className="md:hidden absolute inset-0 w-full h-full overflow-hidden rounded-b-[10px]">
          <div
            className="absolute inset-0 w-full h-full"
            style={{
              backgroundImage: `url(${cargoBgMobile})`,
              backgroundSize: "cover",
              backgroundRepeat: "no-repeat",
              backgroundPosition: "25% 75%",
            }}
          />
        </div>

        <picture className="hidden md:block w-full h-full rounded-b-[10px] overflow-hidden">
          <source srcSet={cargoBgDefault} media="(min-width: 1538px)" />
          <source srcSet={cargoBgXL} media="(min-width: 1280px)" />
          <source srcSet={cargoBgLG} media="(min-width: 1024px)" />
          <source srcSet={cargoBgMD} media="(min-width: 768px)" />
          <img
            src={cargoBgMobile}
            alt=""
            className="w-full h-full object-cover object-right lg:object-[35%_65%] xl:object-[40%_60%] 2xl:object-center"
            aria-hidden
          />
        </picture>
      </div>

      <div className="relative z-10 flex flex-col pt-[88px] md:pt-[120px] lg:pt-[132px] xl:pt-[164px] 
                      px-[20px] md:pl-[40px] md:pr-0 lg:pl-[60px] pb-[224px] md:pb-[52px] lg:pb-[46px] xl:pb-[62px] 
                      w-full xl:pl-[calc((100%-1280px)/2+71px)] 
                      2xl:pl-[calc((100%-1536px)/2+130px)]">
        <div className="xl:max-w-[1280px] 2xl:max-w-[1536px]">
          <p className="text-start text-[20px] sm:text-[30px] md:text-[32px] lg:text-[36px] 
                      2xl:text-[48px] 3xl:text-[72px] font-extrabold mb-[32px]">
            Логистические услуги 
          </p>
          
          <div className="flex flex-col gap-[16px] pb-[22px] xl:pb-[32px] pr-[20%]">
            <div className="flex flex-col gap-[8px]">
              <p className="text-[12px] md:text-[16px] lg:text-[20px] xl:text-[24px] font-bold relative before:content-[''] before:absolute before:left-[-10px] before:top-1/2 before:-translate-y-1/2 before:w-1 before:h-1 before:bg-black before:rounded-full ml-[20px]">
                Доставка точно в срок
              </p>
              <p className="text-[10px] md:text-[14px] lg:text-[16px] xl:text-[20px]">
                Координируем водителей с учетом сроков, чтобы ваш груз прибыл вовремя
              </p>
            </div>
            
            <div className="flex flex-col gap-[8px]">
              <p className="text-[12px] md:text-[16px] lg:text-[20px] xl:text-[24px] font-bold relative before:content-[''] before:absolute before:left-[-10px] before:top-1/2 before:-translate-y-1/2 before:w-1 before:h-1 before:bg-black before:rounded-full ml-[20px]">
                Поддержка 24/7
              </p>
              <p className="text-[10px] md:text-[14px] lg:text-[16px] xl:text-[20px]">
                Всегда на связи для консультаций и решения любых вопросов
              </p>
            </div>
            
            <div className="flex flex-col gap-[8px]">
              <p className="text-[12px] md:text-[16px] lg:text-[20px] xl:text-[24px] font-bold relative before:content-[''] before:absolute before:left-[-10px] before:top-1/2 before:-translate-y-1/2 before:w-1 before:h-1 before:bg-black before:rounded-full ml-[20px]">
                Без комиссий за простой 
              </p>
              <p className="text-[10px] md:text-[14px] lg:text-[16px] xl:text-[20px]">
                Никаких дополнительных платежей за ожидание выгрузки на складе
              </p>
            </div>
          </div>

          <div className="flex gap-[16px] w-full">
            <HashLink
              smooth to="#form"
              className="flex justify-center items-center gap-[8px] bg-[#344E74] hover:bg-[#506fa1] 
                        active:bg-white border-[1px] md:border-[2px] border-[#344E74] 
                        hover:border-[#506fa1] active:text-[#344E74] text-white py-[8.5px] 
                        md:py-[10.5px] lg:py-[18px] px-[16px] lg:px-[30px] rounded-[10px] 
                        lg:rounded-[20px] transition-colors duration-200"
            >
              <span className="text-[12px] md:text-[16px] lg:text-[20px] xl:text-[24px]">Заказать</span>
              <svg 
                width="13" 
                height="16" 
                viewBox="0 0 13 16" 
                className="shrink-0 text-current"
                style={{fill: 'currentColor'}}
              >
                <path d="M7.01278 11.8473C6.97725 11.8144 6.93854 11.7851 6.89722 11.76C6.86035 11.7312 6.81881 11.7091 6.77444 11.6945C6.73144 11.6724 6.68506 11.6577 6.63722 11.6509C6.49886 11.6215 6.35479 11.6367 6.22556 11.6945C6.13593 11.7272 6.05454 11.7793 5.98714 11.8472C5.91974 11.9151 5.86799 11.997 5.83556 12.0873C5.79512 12.1736 5.77534 12.2682 5.77778 12.3636C5.77663 12.4582 5.7938 12.5521 5.82833 12.64C5.87021 12.7269 5.92367 12.8077 5.98722 12.88C6.05471 12.9474 6.13474 13.0007 6.22273 13.0369C6.31073 13.0731 6.40495 13.0915 6.5 13.0909C6.59474 13.0934 6.68873 13.0734 6.77444 13.0327C6.86197 12.9959 6.94258 12.9442 7.01278 12.88C7.07971 12.812 7.13267 12.7315 7.16861 12.6428C7.20455 12.5542 7.22277 12.4594 7.22222 12.3636C7.22108 12.2686 7.20145 12.1747 7.16444 12.0873C7.13007 11.998 7.07853 11.9164 7.01278 11.8473ZM4.00833 8.85091C3.97146 8.82212 3.92992 8.79998 3.88556 8.78545C3.84349 8.75823 3.79706 8.73855 3.74833 8.72727C3.65568 8.70555 3.55932 8.70555 3.46667 8.72727L3.33667 8.77091L3.20667 8.83636L3.09833 8.92364C2.96294 9.06666 2.88786 9.25695 2.88889 9.45455C2.88834 9.55026 2.90656 9.64514 2.9425 9.73375C2.97844 9.82236 3.0314 9.90295 3.09833 9.97091C3.16853 10.0352 3.24914 10.0868 3.33667 10.1236C3.44608 10.1689 3.56486 10.1864 3.68257 10.1746C3.80028 10.1628 3.91331 10.1221 4.01174 10.0561C4.11016 9.98998 4.19096 9.90057 4.24703 9.79569C4.30311 9.69081 4.33274 9.57366 4.33333 9.45455C4.33067 9.26199 4.25586 9.07755 4.12389 8.93818L4.00833 8.85091ZM4.12389 11.8473C4.0552 11.7811 3.97421 11.7292 3.88556 11.6945C3.75482 11.6335 3.60893 11.6132 3.46667 11.6364L3.33667 11.68C3.29064 11.6959 3.24693 11.7179 3.20667 11.7455C3.16883 11.7723 3.13265 11.8015 3.09833 11.8327C3.03258 11.9019 2.98104 11.9835 2.94667 12.0727C2.90846 12.1598 2.88872 12.2539 2.88872 12.3491C2.88872 12.4443 2.90846 12.5384 2.94667 12.6255C2.98324 12.7136 3.03454 12.7948 3.09833 12.8655C3.16462 12.9355 3.24411 12.9915 3.33216 13.0302C3.42021 13.0689 3.51504 13.0896 3.61111 13.0909C3.70585 13.0934 3.79984 13.0734 3.88556 13.0327C3.97308 12.9959 4.05369 12.9442 4.12389 12.88C4.18768 12.8093 4.23898 12.7281 4.27556 12.64C4.31377 12.5529 4.3335 12.4588 4.3335 12.3636C4.3335 12.2685 4.31377 12.1743 4.27556 12.0873C4.24118 11.998 4.18964 11.9164 4.12389 11.8473ZM6.22556 8.78545C6.1369 8.82007 6.05591 8.87197 5.98722 8.93818C5.85525 9.07755 5.78044 9.26199 5.77778 9.45455C5.77837 9.57366 5.808 9.69081 5.86408 9.79569C5.92015 9.90057 6.00095 9.98998 6.09937 10.0561C6.1978 10.1221 6.31083 10.1628 6.42854 10.1746C6.54625 10.1864 6.66503 10.1689 6.77444 10.1236C6.86197 10.0868 6.94258 10.0352 7.01278 9.97091C7.07971 9.90295 7.13267 9.82236 7.16861 9.73375C7.20455 9.64514 7.22277 9.55026 7.22222 9.45455C7.21956 9.26199 7.14475 9.07755 7.01278 8.93818C6.91122 8.83727 6.78225 8.76891 6.64214 8.74172C6.50204 8.71454 6.35708 8.72976 6.22556 8.78545ZM9.90167 11.8473C9.83147 11.783 9.75086 11.7314 9.66333 11.6945C9.53181 11.6389 9.38685 11.6236 9.24675 11.6508C9.10664 11.678 8.97767 11.7464 8.87611 11.8473C8.81036 11.9164 8.75882 11.998 8.72444 12.0873C8.68624 12.1743 8.6665 12.2685 8.6665 12.3636C8.6665 12.4588 8.68624 12.5529 8.72444 12.64C8.76102 12.7281 8.81232 12.8093 8.87611 12.88C8.9436 12.9474 9.02363 13.0007 9.11162 13.0369C9.19962 13.0731 9.29384 13.0915 9.38889 13.0909C9.48363 13.0934 9.57762 13.0734 9.66333 13.0327C9.75086 12.9959 9.83147 12.9442 9.90167 12.88C10.0019 12.7777 10.0698 12.6479 10.0968 12.5068C10.1238 12.3657 10.1086 12.2197 10.0533 12.0873C10.019 11.998 9.96742 11.9164 9.90167 11.8473ZM9.38889 2.90909H3.61111C3.41957 2.90909 3.23587 2.98571 3.10042 3.1221C2.96498 3.25849 2.88889 3.44348 2.88889 3.63636V6.54545C2.88889 6.73834 2.96498 6.92332 3.10042 7.05971C3.23587 7.1961 3.41957 7.27273 3.61111 7.27273H9.38889C9.58043 7.27273 9.76414 7.1961 9.89958 7.05971C10.035 6.92332 10.1111 6.73834 10.1111 6.54545V3.63636C10.1111 3.44348 10.035 3.25849 9.89958 3.1221C9.76414 2.98571 9.58043 2.90909 9.38889 2.90909ZM8.66667 5.81818H4.33333V4.36364H8.66667V5.81818ZM10.8333 0H2.16667C1.59203 0 1.04093 0.229869 0.634602 0.63904C0.228273 1.04821 0 1.60316 0 2.18182V13.8182C0 14.3968 0.228273 14.9518 0.634602 15.361C1.04093 15.7701 1.59203 16 2.16667 16H10.8333C11.408 16 11.9591 15.7701 12.3654 15.361C12.7717 14.9518 13 14.3968 13 13.8182V2.18182C13 1.60316 12.7717 1.04821 12.3654 0.63904C11.9591 0.229869 11.408 0 10.8333 0ZM11.5556 13.8182C11.5556 14.0111 11.4795 14.1961 11.344 14.3324C11.2086 14.4688 11.0249 14.5455 10.8333 14.5455H2.16667C1.97512 14.5455 1.79142 14.4688 1.65598 14.3324C1.52054 14.1961 1.44444 14.0111 1.44444 13.8182V2.18182C1.44444 1.98893 1.52054 1.80395 1.65598 1.66756C1.79142 1.53117 1.97512 1.45455 2.16667 1.45455H10.8333C11.0249 1.45455 11.2086 1.53117 11.344 1.66756C11.4795 1.80395 11.5556 1.98893 11.5556 2.18182V13.8182ZM9.78611 8.85091C9.74924 8.82212 9.7077 8.79998 9.66333 8.78545C9.62033 8.76331 9.57395 8.74856 9.52611 8.74182C9.43346 8.7201 9.3371 8.7201 9.24445 8.74182L9.11445 8.78545L8.98444 8.85091L8.87611 8.93818C8.74414 9.07755 8.66933 9.26199 8.66667 9.45455C8.66726 9.57366 8.69689 9.69081 8.75297 9.79569C8.80904 9.90057 8.88984 9.98998 8.98826 10.0561C9.08669 10.1221 9.19972 10.1628 9.31743 10.1746C9.43514 10.1864 9.55392 10.1689 9.66333 10.1236C9.75086 10.0868 9.83147 10.0352 9.90167 9.97091C9.9686 9.90295 10.0216 9.82236 10.0575 9.73375C10.0934 9.64514 10.1117 9.55026 10.1111 9.45455C10.1085 9.26199 10.0336 9.07755 9.90167 8.93818L9.78611 8.85091Z"/>
              </svg>
            </HashLink>
            <PhoneLink phone="+79203591687"/>
          </div>
        </div>
      </div>
    </div>
  );
};

export default CargoHome;